flappingFoil_solution/backAndCompGrid/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters   0.001;

x0 -260;
x1 840;
y0 -300;
y1 300;
z0 0;
z1 1;

vertices
(
    // background vertices
    ($x0  $y0 $z0)
    ($x1  $y0 $z0)
    ($x1  $y1 $z0)
    ($x0  $y1 $z0)
    ($x0  $y0 $z1)
    ($x1  $y0 $z1)
    ($x1  $y1 $z1)
    ($x0  $y1 $z1)
);

blocks
(    
 hex (0 1 2 3 4 5 6 7)  (190 90 1)  simpleGrading (1 1 1) 
);

edges
(
);

boundary
(
    oversetPatch
    {
      type overset; //leave it empty for comptability when merging with the component grid
      faces ();
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
    lowerPatch
    {
        type patch;
        faces
        (
            (1 5 4 0)

        );
    }
    upperPatch
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)


        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)


        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
