flappingFoil_solution/backAndCompGrid/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            (overset fvMotionSolvers "mylibfvMotionSolvers.so"); 

application   overPimpleDyMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime        6;

deltaT          0.0001;

writeControl    adjustableRunTime;
writeInterval   0.5;

purgeWrite      0; 

writeFormat     ascii;

writePrecision  9;

writeCompression off;

timeFormat      general;

timePrecision   4;

runTimeModifiable true;

adjustTimeStep  yes; 

maxCo           1;

functions
{
#include "forces"
}
  




// ************************************************************************* //
